# vim: set noai ts=4 sw=4 ft=ruby:

#===============================================================================
# THIS FILE IS TEMPLATED, DO NOT EDIT DIRECTLY!
#===============================================================================

################################################################################
# Development
################################################################################
brew "difftastic"
brew "fblog"  # Structured log viewer
brew "fswatch"
brew "git-delta"
brew "glow"   # Markdown formatting for command line
brew "go"
brew "mise"
brew "rbenv"
brew "tokei"  # Line count
brew "xsv"
cask "insomnia"
cask "kreya"  # gRPC/Rest Client
# cask "modern-csv"
cask "ngrok"
cask "tad"
cask "visual-studio-code"

################################################################################
# Essentials
################################################################################
# cask "obsidian" # Need to install this prior to homebrew for notes so having it here messes things up
#--- Launcher + dependencies
# cask "alfred"
cask "raycast"
brew "blueutil" # Needed by toothpick Raycast Extension
#--- Other Utils
cask "contexts"
cask "rectangle-pro"
cask "tailscale"
cask "usb-overdrive"

################################################################################
# System Utilities / Essentials
################################################################################
#cask "obsidian" # Need to install this prior to homebrew for notes so having it here messes things up

# Terminals
tap "wez/wezterm"
cask "wezterm"
cask "ghostty"
# Web Browsers
cask "google-chrome"
cask "firefox"
# System Utilities
cask "balenaetcher"
cask "caffeine"
# cask "chatgpt"
cask "chronycontrol"
#cask "dropbox"
cask "fantastical"
cask "launchcontrol"
cask "todoist"
# cask "xmind"

brew "antidote"
brew "assh"
brew "bat"
brew "btop"
brew "chezmoi"
brew "dua-cli"
brew "duf"
brew "fd"
brew "git", link: true
brew "gnu-sed"
brew "fzf"
brew "lazydocker"
brew "lazygit"
brew "mc"
brew "ncdu"
brew "neofetch"
brew "neovim" #, args: ["HEAD"]
brew "pv"
brew "tmux"
brew "tmuxp"
brew "wget"
brew "dust"
brew "eza"
brew "jq"
brew "restic"
brew "ripgrep"
brew "starship"
brew "tag"

# Backrest
tap "garethgeorge/homebrew-backrest-tap"
# brew "backrest"

# gopass
brew "gnupg"
brew "pinentry-mac"
brew "gopass"

# The following are managed by bin because they do not support homebrew
# https://github.com/egnyte/ax              - Structured log viewer
# https://github.com/sitkevij/hex           - Hex viewer
# https://github.com/ankitpokhrel/jira-cli  - Jira CLI Tool
# github.com/Rigellute/spotify-tui          - Spotify TUI

{{ if eq .area.personal true }}
################################################################################
# Personal Utilities
################################################################################
brew "ffmpeg"
brew "gh"
brew "rclone"
brew "s3cmd"
brew "yt-dlp"
cask "discord"
cask "mark-text"
cask "messenger"
cask "naps2"
cask "plexamp"
cask "shottr"
cask "sonos"
cask "spotify"
cask "steam"
cask "telegram"
cask "tor-browser"
cask "vlc"
cask "xnviewmp"
{{ if eq .focus "personal" }}
cask "orbstack"
{{ end -}}
{{ end -}}

{{ if eq .area.companycam true }}
################################################################################
# CompanyCam
################################################################################
#+++ Docker
cask "claude"
cask "cursor"
cask "docker-desktop"     #-- Casks are Docker Desktop
cask "rubymine"
# brew "docker"           #-- Brew forumulas are barebones
brew "docker-compose"
brew "libpq"    #-- Needed for RubyLSP in VSCode

## Mobile App dependencies
brew "node"
brew "watchman"
{{ end -}}

{{ if eq .area.tractionguest true }}
################################################################################
# Sign In Enterprise
################################################################################
brew "awscli"
brew "ghostscript"
brew "imagemagick"
brew "kubectl"
brew "libffi"
brew "libsodium"
brew "node@18", link: true
brew "postgresql@14"
brew "shared-mime-info"
brew "yarn"
cask "postman"
{{ end -}}

################################################################################
# Fonts / UI Tweaks / Etc
################################################################################
# https://www.nerdfonts.com/font-downloads
cask "font-fira-code"
cask "font-go-mono-nerd-font"
#cask "font-maple"
cask "font-monaspace"
cask "font-open-dyslexic-nerd-font"

#===============================================================================
# THIS FILE IS TEMPLATED, DO NOT EDIT DIRECTLY!
#===============================================================================
