# vim: set noai ts=4 sw=4 ft=ruby:

#===============================================================================
# THIS FILE IS TEMPLATED, DO NOT EDIT DIRECTLY!
#===============================================================================

tap "tinted-theming/tinted"
brew "tinted-theming/tinted/tinty"

################################################################################
# Development
################################################################################
brew "difftastic"
brew "fblog"  # Structured log viewer
brew "fswatch"
brew "git-delta"
brew "glow"   # Markdown formatting for command line
brew "go"
brew "mise"
brew "rbenv"
brew "tokei"  # Line count
brew "uv"     # For MCP Servers
brew "xsv"

# cask "modern-csv"
cask "dash"      # API Docs
cask "insomnia"  # Rest Client
cask "kreya"     # gRPC/Rest Client
cask "ngrok"
cask "tad"
cask "visual-studio-code"
cask "github"

################################################################################
# Essentials
################################################################################
# cask "obsidian" # Need to install this prior to homebrew for notes so having it here messes things up
#--- Launcher + dependencies
# cask "alfred"
cask "raycast"
cask "pearcleaner"               # App Uninstaller
brew "blueutil"                  # Needed by toothpick Raycast Extension
#--- Other Utils
cask "contexts"
# cask "rectangle-pro"           # Handled by raycast now
{{ if eq .area.lshq false }}
cask "tailscale-app"
{{ end }}
cask "usb-overdrive"

# Dictation
brew "whisper-cpp"
brew "sox"
cask "macwhisper"

################################################################################
# System Utilities / Essentials
################################################################################
#cask "obsidian" # Need to install this prior to homebrew for notes so having it here messes things up

#-- Terminals
cask "alacritty"
cask "ghostty"
tap "wez/wezterm"
cask "wez/wezterm/wezterm"

#-- Web Browsers
cask "google-chrome"
cask "firefox"

#-- System Utilities
cask "balenaetcher"
cask "caffeine"
cask "chronycontrol"
# cask "dropbox"
cask "launchcontrol"

#-- Productivity
# cask "chatgpt"
cask "claude"
cask "claude-code"
brew "node"           #-- For npx command / MCP Servers
cask "fantastical"
cask "granola"
cask "todoist-app"
# cask "xmind"

#-- Regular Brew Formulas
brew "antidote"
brew "assh"
brew "bat"
brew "btop"
brew "chezmoi"
brew "dua-cli"
brew "duf"
brew "fd"
brew "git", link: true
brew "gnu-sed"
brew "fzf"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "mc"
brew "ncdu"
brew "neofetch"
brew "neovim" #, args: ["HEAD"]
brew "pv"
brew "tmux"
brew "tmuxp"
brew "wget"
brew "dust"
brew "eza"
brew "jq"
brew "restic"
brew "ripgrep"
brew "starship"
brew "tag"

# PDF Searching / OCR
#   ocrmypdf: https://github.com/ocrmypdf/OCRmyPDF
brew "ocrmypdf"
#   pdf2text: https://github.com/jalan/pdftotext
brew "imagemagick"
brew "pandoc"
brew "pkg-config"
brew "poppler"
brew "python"
#  ripgrep-all: Day to day managed by MISE, but here as a fallback
brew "ripgrep-all"

# Backrest
# tap "garethgeorge/homebrew-backrest-tap"
# brew "garethgeorge/homebrew-backrest-tap/backrest"

# gopass
brew "gnupg"
brew "pinentry-mac"
brew "gopass"

# The following are managed by bin because they do not support homebrew
# https://github.com/egnyte/ax              - Structured log viewer
# https://github.com/sitkevij/hex           - Hex viewer
# https://github.com/ankitpokhrel/jira-cli  - Jira CLI Tool
# github.com/Rigellute/spotify-tui          - Spotify TUI

{{ if eq .area.personal true }}
################################################################################
# Personal Utilities
################################################################################
brew "ffmpeg"
brew "gh"
brew "rclone"
brew "s3cmd"
brew "yt-dlp"
cask "discord"
# cask "mark-text"
cask "messenger"
cask "naps2"
cask "plexamp"
cask "shottr"
cask "sonos"
cask "spotify"
cask "steam"
cask "telegram"
cask "tor-browser"
cask "vlc"
cask "xnviewmp"
{{ if eq .focus "personal" }}
cask "orbstack"
cask "rubymine"
{{ end -}}
{{ end -}}

{{ if eq .area.lshq true }}
################################################################################
# LightspeedHQ Specific Things
################################################################################
brew "awscli"
cask "session-manager-plugin"

#-- pos-service
brew "libffi"
brew "mysql@8.4"
# brew "nvm"    # No longer supported from Homebrew
brew "pyenv"
brew "redis"

# tap "rbenv/tap/openssl"
tap "rbenv/tap"
brew "rbenv/tap/openssl@1.0"

#-- config_service
# tap "AdoptOpenJDK/openjdk"
# cask "adoptopenjdk/openjdk/adoptopenjdk11"
cask "temurin@11"

cask "docker-desktop"     #-- Casks are Docker Desktop
brew "docker-compose"

brew "jenv"

cask "intellij-idea"

cask "cloudflare-warp"

tap "common-fate/granted"
brew "common-fate/granted/granted"
{{ end -}}

{{ if eq .area.companycam true }}
################################################################################
# CompanyCam
################################################################################
#+++ Docker
cask "claude"
cask "cursor"
cask "docker-desktop"     #-- Casks are Docker Desktop
# brew "docker"           #-- Brew forumulas are barebones
brew "docker-compose"
brew "libpq"    #-- Needed for RubyLSP in VSCode

## Mobile App dependencies
brew "node"
brew "watchman"
{{ end -}}

{{ if eq .area.tractionguest true }}
################################################################################
# Sign In Enterprise
################################################################################
brew "awscli"
brew "ghostscript"
brew "imagemagick"
brew "kubectl"
brew "libffi"
brew "libsodium"
brew "node@18", link: true
brew "postgresql@14"
brew "shared-mime-info"
brew "yarn"
cask "postman"
{{ end -}}

################################################################################
# Fonts / UI Tweaks / Etc
################################################################################
# https://www.nerdfonts.com/font-downloads
cask "font-fira-code"
cask "font-go-mono-nerd-font"
#cask "font-maple"
cask "font-monaspace"
cask "font-opendyslexic-nerd-font"

################################################################################
# Mac App Store Apps
################################################################################
mas "1Password - Safari",       id: 1569813296
# mas "Delete Apps: Uninstaller", id: 1033808943   # Pearcleaner is better
mas "Due",                      id: 524373870
mas "Hidden Bar",               id: 1452453066
mas "Slack",                    id: 803453959
mas "Velja",                    id: 1607635845      # Browser Router
mas "VoiceType",                id: 6736525125

#===============================================================================
# THIS FILE IS TEMPLATED, DO NOT EDIT DIRECTLY!
#===============================================================================
