# vim: set noai ts=4 sw=4 ft=ruby:
#===============================================================================
# THIS FILE IS TEMPLATED, DO NOT EDIT DIRECTLY!
#===============================================================================

################################################################################
# Taps
################################################################################
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "wez/wezterm"

################################################################################
# Development
################################################################################
brew "fblog"  # Structured log viewer
brew "git-delta"
brew "go"
brew "xsv"
brew "rbenv"
cask "font-fira-code"
cask "insomnia"
cask "kreya"
# cask "modern-csv"
cask "ngrok"
cask "orbstack"
cask "tad"

################################################################################
# System Utilities / Essentials
################################################################################
cask "obsidian"
cask "wezterm"

brew "antibody"
brew "assh"
brew "bat"
brew "btop"
brew "chezmoi"
brew "dua-cli"
brew "duf"
brew "fd"
# Using OrbStack
# brew "docker"
# brew "docker-compose"
brew "git", link: true
brew "gnu-sed"
brew "fzf"
brew "gnupg"
brew "gopass"
brew "lazydocker"
brew "lazygit"
brew "ncdu"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "pv"
brew "tmux"
brew "tmuxp"
brew "wget"
brew "dust"
brew "exa"
brew "jq"
brew "restic"
brew "ripgrep"
brew "starship"

# The following are managed by bin because they do not support homebrew
# https://github.com/egnyte/ax              - Structured log viewer
# https://github.com/sitkevij/hex           - Hex viewer
# https://github.com/ankitpokhrel/jira-cli  - Jira CLI Tool
# github.com/Rigellute/spotify-tui          - Spotify TUI

{{ if eq .area.personal true }}
################################################################################
# Personal Utilities
################################################################################
brew "rclone"
brew "s3cmd"
cask "plexamp"
cask "sonos"
{{ end -}}

{{ if eq .area.tractionguest true }}
################################################################################
# Sign In Enterprise
################################################################################
brew "awscli"
brew "gh"
brew "ghostscript"
brew "imagemagick"
brew "kubectl"
brew "libffi"
brew "libsodium"
brew "node@16", link: true
brew "postgresql@14"
brew "shared-mime-info"
brew "yarn"
cask "postman"
{{ end -}}

################################################################################
# Fonts / UI Tweaks / Etc
################################################################################
# https://www.nerdfonts.com/font-downloads
tap "homebrew/cask-fonts"
cask "font-go-mono-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-maple"

#===============================================================================
# THIS FILE IS TEMPLATED, DO NOT EDIT DIRECTLY!
#===============================================================================
